# MPerKN Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..MPerKN Property
SymbolTypeId Class See Also
---
Symbol m/kN, indicating unit Meters per kilonewton.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MPerKN { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MPerKN As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MPerKN {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace